// 9. 百钱百鸡问题
// 题目描述：
// 公鸡5文钱一只，母鸡3文钱一只，小鸡3只1文钱。用100文钱买100只鸡，其中公鸡、母鸡、小鸡都必须有。问公鸡、母鸡、小鸡各买多少只？列出所有可能的解。
// 考察点： 三重循环穷举算法逻辑。
// 5g + 3m + (100 - g - m)/3 = 100
#include <stdio.h>
int main()
{
    int g = 0;
    int m = 0;
    int x = 0;

    for (g = 1; g <= 19; g++)
    {
        for (m = 1; m <= 32; m++)
        {
            x = (100 - g - m);
            if (x >= 1 && x % 3 == 0 && (5 * g + 3 * m + x / 3) == 100)
            {
                printf("公鸡%d 母鸡:%d 小鸡%d\n", g, m, x);
            }
        }
    }
}
